frontend/controllers/ShopController.php

    public function actionIndex()
    {
        $this->view->title = '商城首页';
        $recommend = Shop::find()->where(['is_show'=>'1'])->orderBy('hot ASC')->all();
---
SELECT * FROM `shop` `shop` WHERE `is_show`='1' ORDER BY `hot`

    public function actionLogin()
    {
        $this->view->title = '登陆';
        $this->layout = 'empty';
        if (!user()->isGuest) {
            return $this->redirect(['shop/index']);
        }
        $model = new User(['scenario' => 'login']);
        if ($model->load(post())) {
            $user = User::find()->where(['mobile' => $model->username])->one();
---
SELECT * FROM `user` `user` WHERE `mobile`='123456'