frontend/controllers/SiteController.php

SELECT * FROM `product` `product` WHERE `id`='21'
SELECT * FROM `order` `order` WHERE ((`order_state`=1) AND (`user_id`=100001) AND (`product_id`=21)) AND (`created_at` > '2018-01-12 00:00:00') ORDER BY `created_at` DESC
SELECT * FROM `order` `order` WHERE (`user_id`=100001) AND (`product_id`=21) ORDER BY `created_at` DESC
---
    public function actionIndex()
    {
        $this->view->title = config('web_name');
        //找三个上架的产品ON_SALE_YES
        $productArr = Product::getIndexProduct();
        foreach ($productArr as $key => $value) {
            $jsonArr[] = $value['table_name'];
        }
        $json = json_encode($jsonArr);
        reset($productArr);
        $pid = get('pid', key($productArr));
        //这条期货信息
        $product = Product::find()->where(['id' => $pid])->with('dataAll')->one();
        //最新的这条期货数据集
        $newData = DataAll::newProductPrice($product->table_name);
        $orders = Order::find()->where(['order_state' => Order::ORDER_POSITION, 'user_id' => u()->id, 'product_id' => $product->id])->andWhere(['>', 'created_at', date('Y-m-d 00:00:00', time())])->with('product')->orderBy('created_at DESC')->all();
        //这个产品购买后的30秒不能购买
        $order = Order::find()->where(['user_id' => u()->id, 'product_id' => $product->id])->orderBy('created_at DESC')->one();

SELECT * FROM `data_all` `dataAll` WHERE `name`='mila'
---
    public function actionGetData($id)
    {
        $model = Product::findModel($id);
        $name = $model->table_name;
        $unit = get('unit');
        switch ($unit) {
            case 'day':
                $time = '1';
                $format = '%Y-%m-%d';
                break;
            default:
                $lastTime = \common\models\DataAll::find()->where(['name' => $name])->one()->time;