frontend/models/User.php

    protected function getIdentity()
    {
        if ($this->_identity === null) {
            $this->_identity = WebUser::find()->where(['username' => $this->username])->one();
---
SELECT * FROM `user` WHERE `username`='123456'